#!/usr/bin/env python
# -*- coding:utf-8 -*-
# ------------------------------------------------------------
# 参考资料：
#
#
# ------------------------------------------------------------
# ******************** 中文名称 *******************
# ******************** 中文名称 *******************
# 如：
# ******************** chapter3 科学计算库Numpy *******************

# =====>>>>>>内容概览
# =====>>>>>>内容概览
# 课程英文名称
# 如：
# chapter3_numpy

'''

# 目录结构

'''

# ------------------------------------------------分割线-------------------------------------------------
# ------------------------------------------------分割线-------------------------------------------------
# ------------------------------------------------分割线-------------------------------------------------
'''
# # ------------------------------------------------------------
# # # 1、语法错误，SyntaxError --变量
# # # #
# # ------------------------------------------------------------
'''


# def bubble_sort(alist):
#     for j in range(len(alist)-1,0,-1):
#         # j表示每次遍历需要比较的次数，是逐渐减小的
#         for i in range(j):
#             if alist[i] > alist[i+1]:
#                 alist[i], alist[i+1] = alist[i+1], alist[i]
# li = [54,26,93,17,77,31,44,55,20]
# bubble_sort(li)
# print(li)
#


'''
# # ------------------------------------------------------------
# # # 1、基本的冒泡排序
# # # # 没有任何的优化
# # ------------------------------------------------------------
'''

import time

def bubble_sort(alist):
    n = len(alist)
    for j in range(0, n-1):
        for i in range(0, n-1):
            if alist[i] > alist[ i +1 ]:
                alist[i], alist[i+1] = alist[i+1], alist[i]


li = [54,26,93,17,77,31,44,55,20]
start_time = time.time()

bubble_sort(li)
end_time = time.time()

print(li)
print("elapsed: %f" % (end_time - start_time))
print("complete!")
#
#
# '''
# # # ------------------------------------------------------------
# # # # 2、基本的冒泡排序
# # # # # 初步优化
# # # ------------------------------------------------------------
# '''
#
#
# def bubble_sort(alist):
#     n = len(alist)
#     for j in range(0, n-1):
#         for i in range(0, n-1-j):
#             if alist[i] > alist[ i +1 ]:
#                 alist[i], alist[i+1] = alist[i+1], alist[i]
# # j 0;  i 0, n-1 - 0
# # j 1   i 0, n-1 - 1
# # j 2   i 0, n-1 - 2
# # j 3   i 0, n-1 - 3
#
#
# li = [54,26,93,17,77,31,44,55,20]
# bubble_sort(li)
# print(li)
#
#
#
#
#
# '''
# # # ------------------------------------------------------------
# # # # 3、最终的冒泡排序
# # # # # 最终优化
# # # ------------------------------------------------------------
# '''
#
#
def bubble_sort(alist):
    n = len(alist)
    for j in range(0, n-1):
        count = 0
        for i in range(0, n-1-j):

            if alist[i] > alist[ i +1 ]:
                count += 1
                alist[i], alist[i+1] = alist[i+1], alist[i]

        if count == 0:
            # 说明没有进行排序，原来给定的序列就是一个排序好的
            break
            # return  # return 也可以

# j 0;  i 0, n-1 - 0
# j 1   i 0, n-1 - 1
# j 2   i 0, n-1 - 2
# j 3   i 0, n-1 - 3


li = [54,26,93,17,77,31,44,55,20]
print(li)

bubble_sort(li)
print(li)
